---
kind: method
id: M:Autodesk.Revit.DB.SketchPlane.GetPlaneReference
source: html/21ff547e-019a-998f-77c0-5775c0b814ca.htm
---
# Autodesk.Revit.DB.SketchPlane.GetPlaneReference Method

Returns a reference to this element as a plane.

## Syntax (C#)
```csharp
public Reference GetPlaneReference()
```

## Returns
The reference.

## Remarks
The object returned here can be used with the PointOnPlane class.